#+TITLE: 2020免修考



|         |       1 |        2 |        3 |     4 |          |             |
| test273 | if/else | standard | for-loop | happy |          |             |
| test233 |         |        3 |          |     5 | 2. speak | 4. computer |
|     003 |     100 |      100 |      100 |    60 |        0 |         100 |
|     001 |     100 |        0 |      100 |    60 |        0 |         100 |
|     002 |     100 |        0 |      100 |     0 |        0 |         100 |



2:62:1:2,3:14:1:3,4:192:1:4,5:305:1:5


1:62:1:1,
2:104:1:2,
3:204:1:3,
4:192:1:4,
5:142:1:5

14: 標準差
62: 棒打老虎雞吃蟲
142: 字串/replacement
192: 字串/排序
305: 你快樂嗎?


#+begin_src python -r -n :results output :exports both
n = int(input())

def nextN(n):
    sos = 0
    while n != 0:
        r = n % 10
        sos += r * r
        n //= 10
    return sos

print(n)
slow = n
fast = n
while True:
    slow = nextN(slow)
    fast = nextN(nextN(fast))
    print(slow)
    if slow == fast:
        break

if fast == 1:
    print("Happy")
else:
    print("Unhappy")


#+end_src

#+RESULTS:
#+begin_example
999
243
29
85
89
145
42
20
4
Unhappy
#+end_example



#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int nextN(int nn) {
    int sos = 0;
    int r;
    while (nn != 0) {
        r = nn % 10;
        sos += r * r;
        nn = nn / 10;
        }
    return sos;
}
int main() {
    int n = 9;
    //cin >> n;
    cout << n << endl;
    int slow = n;
    int fast = n;
    do {
        slow = nextN(n);
        fast = nextN(nextN(n));
        cout << slow << endl;
    } while (slow != fast);
    if (fast == 1) {
        cout << "Happy\n";
    } else {
        cout << "Unhappy\n";
    }
    
}
#+end_src
